<!--
 * @Author: changh
 * @Date: 2017-07-03
 * @Description: 掌麦协议
<!--协议-->


<template>
  <el-dialog :visible="dialogVisible" title="掌麦商家使用协议" class="zmdialogstyle1 dialogwidth720"  @close="close" size="small">
    <div class="pop_con">
      <br><br>
      <p>
      <h1 align="center" style="text-align:center;">掌麦超市管理大师系列产品用户注册协议<span></span></h1>
      <br>
      <p>
        本《掌麦超市管理大师系列产品用户注册协议》（以下简称“本协议”）是您和四川掌麦科技有限公司（以下简称“掌麦”）就注册、使用掌麦超市管理大师系列产品（以下简称“软件”）于中国四川省成都市订立的具有法律约束力的协议。<span></span>
      </p>
      <br><br>
      <h2>第一章 总则<span></span></h2>
      <br>
      <p>
        <strong><u>掌麦超市管理大师系列产品是指由掌麦自主开发并享有知识产权、所有权等全部合法权益的包含电脑收银软件、手机收银软件、</u><span><u>iPad</u></span><u>收银软件、安卓收银软件、</u><span><u>WEB</u></span><u>管理后台、手机管理后台、网上超市软件、增值平台软件等在内的软件产品。本协议项下您可使用的软件产品类型以您实际向掌麦购买或通过掌麦公布的官方渠道下载或以其他合法方式获取的特定软件产品为准；您了解并同意，您购买或下载某一上述具体的软件产品不意味着您可使用另一特定类型的软件产品。您在购买或下载某一特定软件产品前，请您务必仔细阅读</u></strong><span><a
        href="http://www.pospal.cn/" target="http://beta.pospal.cn/_blank"><u>掌麦官方网站</u></a></span><strong><u>（网址链接：</u></strong><span><a
        href="http://www.pospal.cn/"
        target="http://beta.pospal.cn/_blank"><u>http://</u><strong><u>www.izhangmai.com</u></strong></a></span><strong><u>）上的产品介绍或其他掌麦制定、发布的使用规则上的说明以购买、下载符合您实际需求的软件产品类型及版本。</u></strong>
      </p>
      <p><strong><u><br/>
      </u></strong></p>
      <p>企业用户（指依据中国法律设立并有效存续的企业法人或其他组织形式，以下简称“您”）通过运行本掌麦超市管理大师系列产品，并在注册页面挑选“阅读并同意”或类似按钮，这表示您与掌麦达成并接受本协议。<strong><u>在您选择注册帐号并使用本软件之前，请您务必仔细阅读以下条款，特别是以黑体加粗形式提示您注意的条款。若您一旦挑选“阅读并同意”或类似按钮，则表示您同意受以下全部条款的约束。若您不接受以下全部或部分条款，请您立即停止使用掌麦超市管理大师系列产品。</u></strong>
      </p>
      <br>
      <h2>第二章 软件功能<span></span></h2>
      <p><b>第一条、</b>&nbsp;掌麦提供的软件包含以下类型及功能（下述软件类型及功能可能因掌麦的单方判断而被增加或修改，或因定期、不定期的维护而暂缓提供）：<span></span></p>
      <p style="text-indent:21pt;">1. <u>电脑收银软件：</u></p>
      <p style="text-indent:21pt;">2. <u>手机收银软件：</u></p>
      <p style="text-indent:21pt;">3. <u>iPad</u><u>收银软件：</u></p>
      <p style="text-indent:21pt;">4. <u>安卓收银软件：</u></p>
      <p style="text-indent:21pt;">5. <u>WEB</u><u>管理后台软件：</u></p>
      <p style="text-indent:21pt;">6. <u>手机管理后台<span>APP</span>软件：</u></p>
      <p style="text-indent:21pt;">7. <u>网上超市<span>APP</span>软件：</u></p>
      <p style="text-indent:21pt;">8. 掌麦提供的其他类型软件产品。<span></span></p>
      <p style="text-indent:21pt;"><br/>
      </p>
      <p><b>第二条、</b>掌麦保留在任何时候自行决定对软件及其相关功能、变更、升级、修改、转移的权利。掌麦进一步保留开发新的模块、功能和软件或其它语种服务的权利。上述所有新的模块、功能、软件的提供，除非掌麦另有说明，否则仍适用本协议。您在此同意并确认，掌麦在任何情况下都无需向您在使用本软件时发生的在传输或联络中的迟延、不准确、错误或疏漏及因此而致使的损害负责。<span></span>
      </p>
      <br>
      <h2>第三章 软件使用规则<span></span></h2>
      <p><b>第三条、</b><b>&nbsp;</b><b>软件的获取及收费：<span></span></b></p>
      <p><b>1</b><b>、<u>软件获取：您应当从掌麦公布的官方渠道下载或以其他合法方式获取本软件。如果您从未经掌麦授权的第三方获取本软件或与本软件名称相同的安装程序，掌麦无法保证该软件能够正常使用，并对因此给您造成的损失不予负责。<span></span></u></b>
      </p>
      <p><b><u>2</u></b><b><u>、收费：掌麦保留收取服务费用或者是改变服务费用的权利。您因使用掌麦超市管理大师获取有偿服务而发生的所有应纳税赋，以及相关硬件、软件、通讯、网络服务及其他方面的费用均由您自行承担。掌麦保留在无须发出书面通知，仅在掌麦官方网站或其它相关渠道公示的情况下，暂时或永久地更改或停止部分或全部服务的权利。<span></span></u></b>
      </p>
      <p><b><u>3</u></b><b><u>、试用期：在正式购买超市管理大师系列产品前，您可以通过邮件、手机、第三方应用授权等方式进行验证注册，验证后，您将享有超市管理大师<span>15</span>天的免费试用期。在试用期结束前，如需正式购买，请自助在线购买或主动联系掌麦的工作人员或经销商进行购买。试用期结束后，掌麦没有义务为您保留原账号中或与之相关的任何信息。<span></span></u></b>
      </p>
      <p><b>第四条、</b>&nbsp;注册账号：您应当按照掌麦显示的注册页面提示进行注册账号的相关操作。<strong><u>同时，掌麦开通让您可以上传企业营业执照、身份证及相关授权委托书的复印件、扫描件等文件的选项，为保证您作为软件使用权人的合法权益，掌麦鼓励您在注册帐号时自行上传上述文件，并在实际情况发生变动时及时进行更新。上述文件将作为您找回帐号、密码的重要依据；如您选择不进行上传或不及时更新，您在使用软件的过程中发生帐号、密码被盗用，或内部员工、第三人违规操作等情形致使您无法正常使用软件的，掌麦将不承担任何责任。</u></strong>
      </p>
      <p><b>第五条、</b>&nbsp;信息发送：您的账号下的商品信息和销售情况等信息将会发送到超市管理大师系统服务器，这是为了让您可以通过手机，使用掌麦的其他软件系列产品（具体可使用的其他软件产品类型以实际情况为准），实时查看商店中的销售报表、交易记录、用户信息等数据。掌麦保证对这些信息承担严格的保密义务，除为您提供服务及改善服务质量等合法目的外，不将这些信息用于其他目的，也不会把这些信息用作违法或不道德的用途。<span></span>
      </p>
      <p><b>第六条、</b>&nbsp;软件升级功能：基于改进服务、提高用户体验的目的，掌麦有权不定时对软件进行更新；同时，您可以通过掌麦公布的官方渠道下载更新过的软件版本。<span></span></p>
      <p><b>第七条、</b>&nbsp;服务质量监测：您确认并同意，为了监测和改善掌麦服务质量，本软件在适当的时候会把软件运行时与服务质量有关的数据发送到掌麦超市管理大师系统服务器，并进行相应的处理和分析。掌麦保证对这些数据承担严格的保密义务，除为您提供服务及改善服务质量等合法目的外，不将这些信息用于其他目的，也不会把这些数据用作违法或不道德的用途。<span></span>
      </p>
      <br>
      <h2>第四章 您的权利和义务<span></span></h2>
      <p><b>第八条、</b>&nbsp;您应妥善保管注册账号和密码，同时对注册账号和密码安全承担全部责任。除有充足的相反证据外，通过您的注册账号和密码进行的全部操作均视为您自行操作的行为。<span></span></p>
      <p><b>第九条、</b>&nbsp;您应当保证向掌麦提交的注册信息均真实、准确、及时、详尽和完整，并不断更新注册资料，以符合前述要求；您保证您提交的信息不含有任何违反国家法律、法规及中华人民共和国承认或加入的国际条约的内容，且您通过软件所从事的一切活动都是合法、真实、有效的，不侵权任何第三方的合法权益。<span></span>
      </p>
      <p><b>第十条、</b>&nbsp;如您发现您的注册账号、密码遭他人非法使用，应立即以有效的方式通知掌麦并提供您作为软件使用权人的合法证明文件，您同意授权掌麦采取一切合理措施以保证您的利益不受损害，并认可该等措施所产生的法律效果归于您自身。因黑客攻击行为或您的保管疏忽等导致注册账号、密码遭他人非法使用所造成的损失由您自行承担，掌麦不承担任何责任。<span></span>
      </p>
      <p><b>第十一条、</b>&nbsp;您理解并保证不利用软件传输或发表包含以下内容的言论：<span></span></p>
      <p style="text-indent:21pt;">1. 反对宪法所确定的基本原则，煽动、抗拒、破坏宪法和法律、行政法规实施的；<span></span></p>
      <p style="text-indent:21pt;">2. 煽动颠覆国家政权，推翻社会主义制度，煽动、分裂国家，破坏国家统一的；<span></span></p>
      <p style="text-indent:21pt;">3. 损害国家机关信誉的、损害国家荣誉和利益的、损害社会公共利益和涉及国家安全的；<span></span></p>
      <p style="text-indent:21pt;">4. 煽动民族仇恨、民族歧视，破坏民族团结的；<span></span></p>
      <p style="text-indent:21pt;">5. 任何包含对种族、性别、宗教、地域内容等歧视的；<span></span></p>
      <p style="text-indent:21pt;">6. 捏造或者歪曲事实，散布谣言，扰乱社会秩序的；<span></span></p>
      <p style="text-indent:21pt;">7. 宣扬封建迷信、邪教、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；<span></span></p>
      <p style="text-indent:21pt;">8. 骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的、公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的；<span></span>
      </p>
      <p style="text-indent:21pt;">9. 其他违反宪法和法律行政法规的<span></span></p>
      <p><b>第十二条、</b>&nbsp;您在此声明并保证：<span></span></p>
      <p style="text-indent:21pt;">1. 您通过本软件发布的所有信息（包括但不限于您使用的企业名称、<span>Logo</span>、商品信息、商品介绍等），均系真实、完整、合法的信息，不侵犯任何第三方的知识产权、所有权、肖像权、名誉权、姓名权、商誉等合法权益，但掌麦及其关联公司无义务对此等信息进行审核。<span></span>
      </p>
      <p style="text-indent:21pt;">2. 您通过本软件所发布的任何信息或提供的任何资料都必须符合掌麦当时及此后公示的发布须知及相关文字说明。<span></span></p>
      <p style="text-indent:21pt;">3. 您将通过本软件维护并及时更新上述资料，以保证其真实、准确、及时、合法和完整性。<span></span></p>
      <p><b>第十三条、</b>&nbsp;<strong>您进一步理解并同意，如果您提供的信息不真实，不准确，不及时，不合法或不完全，或掌麦有合理的理由怀疑其真实性，准确性、及时性、合法性和完整性，则掌麦有权拒绝您使用任何现有的软件及以后可能提供的软件或服务。</strong>
      </p>
      <p><b>第十四条、</b><u>&nbsp;</u><strong>为保证掌麦的合法权益不受侵害，以下是掌麦禁止您进行的一些有害活动的示例，包括但不限于：</strong></p>
      <p style="text-indent:21pt;">1. 禁止出售、转售或复制、开发掌麦授予的使用权限；<span></span></p>
      <p style="text-indent:21pt;">2. 禁止基于商业目的模仿掌麦的产品和服务；<span></span></p>
      <p style="text-indent:21pt;">3. 禁止复制和模仿掌麦的设计理念、界面、功能和图表；<span></span></p>
      <p style="text-indent:21pt;">4. 禁止未经掌麦许可基于软件或其内容进行修改或制造派生其他产品；<span></span></p>
      <p style="text-indent:21pt;">5. 您只能处于您商业范围内使用软件，禁止发送违反法律的信息，禁止发送和储存带有病毒的、蠕虫的、木马的和其他有害的计算机代码、文件、脚本和程序。<span></span>
      </p>
      <p><b>第十五条、</b>&nbsp;<strong>您进一步同意对软件和<span>/</span>或软件任何部分（软件产品、页面标识、服务品牌、资讯、信息）不进行复制、翻译、修改、适配、增强、反编译、反汇编、反向工程、分解拆卸、出售、转租或作任何商业目的的使用。您同意约束其有必要使用该软件的员工、代理、咨询者或顾问遵守前述之义务，并就其违反前述规定的行为对掌麦负责就如同您自身违反。</strong>
      </p>
      <p class="MsoNormal"><b>第十六条、</b>&nbsp;您必须自行配备上网所需的设备，包括计算机、购买正版操作系统、调制解调器或其它必备的上网设备，并自行负担上网所需的电话费用、网络服务费用等。<b><u>由于操作系统的法律相关风险由您自己承担，掌麦科技不承担任何责任。<span></span></u></b>
      </p>
      <p>&nbsp;</p>
      <p><b>第十七条、</b>&nbsp;您承诺通过软件进行的活动所引发的一切法律后果，由您承担全部责任。如因您使用软件的行为，导致掌麦或任何第三方为此承担了相关的责任，则您需全额赔偿掌麦或任何第三方的相关支出及损失，包括合理的律师费用。<span></span>
      </p>
      <p><b>第十八条、</b>&nbsp;<strong>您同意如因其违反本协议规定的任何条款或掌麦不时发布的各项规则、通告。掌麦有权单方判断立即终止您使用软件，而无需事先通知您。</strong></p>
      <p><b>第十九条、</b>&nbsp;您同意在使用软件的同时，同意接受掌麦提供的各类信息服务。<span></span></p>
      <br>
      <h1 align="center" style="text-align:center;">第五章
        掌麦的权利和义务<span></span></h1>
      <br>
      <p><b>第二十条、</b>&nbsp;掌麦将按照本协议的规定许可您使用软件。<span></span></p>
      <p>
        <b>第二十一条、</b>&nbsp;掌麦有权随时删除含有任何违反法律法规、本协议及掌麦发布的各项规则的信息或链接，包括掌麦对此有合理怀疑的信息。掌麦有权单独对您提供的信息是否属于上述范围做出判断。<span></span>
      </p>
      <p><b>第二十二条、</b>&nbsp;<strong>如果掌麦发现或收到他人举报您发布的信息违反相关法律规定或侵犯任何第三方的合法权益的，掌麦有权进行独立判断并采取技术手段予以删除、屏蔽或断开链接。同时，掌麦有权视您的行为性质，采取包括但不限于暂停或终止服务，限制、冻结或终止您使用本软件的权利，追究您的法律责任等措施；同时，掌麦在采取上述措施之后将以适当的方式（包括但不限于邮件、电话、公告等）通知您。您违反第八条约定，导致任何第三方损害的，您应当独立承担责任；掌麦因此遭受损失的，您也应当一并赔偿。</strong>
      </p>
      <p>
        <b>第二十三条、</b>&nbsp;<strong>您接到掌麦的通知书后，认为您的行为未侵犯他人权利的，可以向掌麦提交书面说明，要求恢复被删除的信息，或者恢复被断开的信息的链接。书面说明应当包含下列内容：</strong>
      </p>
      <p style="text-indent:21pt;"><strong>1. </strong><strong>您的姓名（名称）、联系方式和地址；</strong></p>
      <p style="text-indent:21pt;"><strong>2. </strong><strong>要求恢复的信息的名称和网络地址；</strong></p>
      <p style="text-indent:21pt;"><strong>3. </strong><strong>不构成侵权的初步证明材料。</strong></p>
      <p><strong>您应当对书面说明的真实性负责。</strong></p>
      <p><b>第二十四条、</b>&nbsp;<strong>掌麦接到您的书面说明并进行审核后，可以采取恢复被删除的信息或者恢复被断开的信息的链接等措施，同时将您的书面说明转送举报人。如举报人仍存在异议的，由您与举报人自行协商或采用法律手段等合法方式自行解决，掌麦可以基于您或者举报人的要求提供适当的协助。但是，您理解并同意，上述掌麦可采取的措施是掌麦的权利而非义务。<span></span></strong>
      </p>
      <br>
      <h2>第六章 隐私条款<span></span></h2>
      <p><b>第二十五条、</b>&nbsp;在您使用本软件的过程中，掌麦可能会按照本协议规定的方式收集和使用与您相关的信息，掌麦保证按照法律法规的规定严格保护您的企业信息、商业秘密及其他信息，在使用本软件前，请您仔细阅读以下条款。<span></span>
      </p>
      <p><b>第二十六条、</b>&nbsp;一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别的考虑，您将无法对您的注册账号信息进行修改。<span></span></p>
      <p><b>第二十七条、</b>&nbsp;掌麦将在其网络系统内建立合理的安全体系，包括身份识别体系、内部安全防范体系，以使您数据完整，并且保密。但您了解并同意技术手段在不断更新，掌麦无法杜绝全部的非安全因素，但掌麦会及时更新安全体系，妥善维护网络及相关数据。<span></span>
      </p>
      <p><b>第二十八条、</b>&nbsp;<strong>掌麦可能会收集您的相关信息，包含但不限于您填写的手机号码、商品信息、交易流水、客户信息等相关信息。未经您的同意，掌麦不会向任何无关的公司、组织和个人披露您的敏感信息，但法律法规和本协议另有规定的除外。</strong>
      </p>
      <p><b>第二十九条、</b>&nbsp;您理解并同意，为改善用户体验及提供本服务，掌麦可以：<span></span></p>
      <p style="text-indent:21pt;">1. 合理使用您提交的公司信息，包括但不限于您的注册信息、在本服务中的相关操作及其他公司信息；<span></span></p>
      <p style="text-indent:21pt;">2.
        因您在注册或开通某项服务、功能时选择或同意，或因您要求掌麦或第三方提供特定服务时，掌麦需要将您的相关信息提供给与此相关联的第三方或其他机构。<span></span></p>
      <br>
      <h2>第七章 第三方服务说明<span></span></h2>
      <p><b>第三十条、</b>&nbsp;您了解并确认软件中可能包含由第三方提供的服务，掌麦只是为了您的便利而提供该功能模块，但是掌麦并不控制第三方的服务内容，也不对其负责。您如需使用此等服务，应另行与第三方服务提供方达成服务协议，支付相应费用并承担可能的风险。掌麦对第三方提供的服务不提供任何形式的保证。<span></span>
      </p>
      <br>
      <h2>第八章 知识产权<span></span></h2>
      <p>
        <b>第三十一条、</b>&nbsp;掌麦拥有本协议所规定的软件产品的著作权、商标权、专利权、专利申请权、专有技术、商业秘密以及其他相关的知识产权，包括与该软件有关的各种文档资料。其它本协议中未经提及的权利亦由掌麦保留。<span></span>
      </p>
      <p><b>第三十二条、</b>&nbsp;<strong>未经掌麦事先书面同意，您不得为任何营利性或非营利性的目的自行实施、利用、转让或许可任何第三方实施、利用、转让上述知识产权。</strong></p>
      <br>
      <h2>第九章 协议的终止<span></span></h2>
      <p><b>第三十三条、</b>&nbsp;<strong>掌麦有权在下列情形下拒绝您的订购或终止本协议，而无需承担任何责任：</strong></p>
      <p style="text-indent:21pt;">1. 您违反了本协议的任一条款，且自掌麦通知您纠正后的合理期限内仍未纠正的；<span></span></p>
      <p style="text-indent:21pt;">2. 掌麦或掌麦授权的第三方无法确认您提供的注册信息的真实性的；<span></span></p>
      <p style="text-indent:21pt;">3.
        掌麦授予您的软件使用许可期限届满。软件使用许可期限届满后如需继续使用本协议约定之产品的，则您需与掌麦另行签署有关购买该软件的标准订单或按照掌麦公布的规则获取软件产品使用权，并且可能需要您向掌麦或掌麦指定的第三方支付相应的费用。<span></span>
      </p>
      <p><b>第三十四条、</b>&nbsp;如协议一方，除为重组或兼并的目的外，通过决议或由法院判令解散，则接收方或指定的债权人代表有权经通知后终止本协议。<span></span></p>
      <br>
      <h2>第十章 免责及责任的限制与排除<span></span></h2>
      <p><b>第三十五条、</b>&nbsp;掌麦以“现状”、“有缺陷”和“当前功能”的状态提供软件。掌麦不保证软件在操作上不会中断或没有错误，不保证其会纠正软件的所有缺陷，亦不保证软件能满足您的所有要求。您承担所有关于令人满意的质量、性能、准确性的风险。<span></span>
      </p>
      <p><b>第三十六条、</b>&nbsp;在所适用的法律允许的范围内，掌麦不做任何明示的或默示的声明，也不给予任何明示的或默示的保证或条件，包括但不限于：<span></span></p>
      <p style="text-indent:21pt;">1. 关于适销性、特定用途适用性、准确性和无侵权行为的任何保证或条件；<span></span></p>
      <p style="text-indent:21pt;">2. 在交易过程或行业惯例中产生的任何保证或条件；<span></span></p>
      <p style="text-indent:21pt;">3. 在访问或使用软件时不受干扰、没有错误的任何保证或条件。<span></span></p>
      <p><b>第三十七条、</b>&nbsp;<strong>除掌麦存在故意或重大过失外，掌麦不就因您使用本软件引起的，或在任何方面与掌麦的产品和服务有关的任何意外的、非直接的、特殊的、或间接的损害或请求（包括但不限于因人身伤害、因隐私泄漏、因未能履行包括诚信或合理谨慎在内的任何责任、因过失和因任何其他金钱上的损失或其他损失而造成的损害赔偿）承担任何责任。</strong>
      </p>
      <p>
        <b>第三十八条、</b>&nbsp;掌麦不就电讯系统或互联网的中断或无法运作、技术故障、计算机错误或病毒、信息损坏或丢失或其它在掌麦合理控制范围之外的原因而产生的其他任何性质的破坏而向您或任何第三方承担损害赔偿责任。<span></span>
      </p>
      <p><b>第三十九条、</b>&nbsp;双方承认本条款反映了双方就协商谈判达成的一致意见。双方均完全了解本条款的后果并进一步承认本条款的合理性。<span></span></p>
      <br>
      <h2>第十一章 不可抗力<span></span></h2>
      <p><b>第四十条、</b>&nbsp;如果由于黑客攻击或政府管制或网络通讯瘫痪等对其发生和后果不能预见的事件，双方均确认此属不可抗力；双方应按照不可抗力对影响履行本协议的程度，协商决定是否解除本协议、免除履行本协议的部分义务，或者延期履行本协议。<span></span>
      </p>
      <br>
      <h2>第十二章 违约责任<span></span></h2>
      <p><b>第四十一条、</b>&nbsp;您同意保障和维护掌麦的利益，负责支付由您违反本协议和<span>/</span>或其他服务条款引起的律师费用、损害补偿费用、政府机关处罚费用和其它侵权赔偿费用等。如您违反本协议中的任一条款，掌麦保留以合法手段追究您的违约或侵权责任的权利。<span></span>
      </p>
      <br>
      <h2>第十三章 法律及争议解决<span></span></h2>
      <p><b>第四十二条、</b>&nbsp;本协议适用中华人民共和国法律。如遇本协议有关的某一特定事项缺乏明确法律规定，则应参照通用国际商业惯例和（或）行业惯例<span></span></p>
      <p><b>第四十三条、</b>&nbsp;<strong>因双方就本协议的签订、履行或解释发生争议，双方应努力友好协商解决。如协商不成，任何一方均有权向掌麦所在地有管辖权的人民法院起诉。</strong></p>
      <br>
      <h2>第十四章 协议的转让<span></span></h2>
      <p><b>第四十四条、</b>&nbsp;除非取得掌麦事先书面同意，您不得将其在本协议项下的权利与义务转让给任何第三方。<span></span></p>
      <br>
      <h2>第十五章 其他<span></span></h2>
      <p><b>第四十五条、</b>&nbsp;协议构成您和掌麦间就使用软件的完整的协议，并取代双方就有关本协议所载任何事项于先前以口头及书面达成的共识。<span></span></p>
      <p><b>第四十六条、</b>&nbsp;如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余部分则仍具有法律效力。<span></span></p>
      <p><b>第四十七条、</b>&nbsp;本协议的标题仅为方便阅读所设，非对条款的定义、限制、解释或描述其范围或界限。<span></span></p>
      <p><b>第四十八条、</b>&nbsp;掌麦于您过失或违约时放弃本协议规定的权利的，不得视为其对您的其他或以后同类之过失或违约行为弃权。<span></span></p>
      <p><b>第四十九条、</b>&nbsp;<strong>掌麦有权随时根据中华人民共和国有关法律、法规的变化、互联网的发展以及公司经营状况和经营策略的调整等修改本协议。您若继续使用软件就有必要对最新的《掌麦超市管理大师系列产品用户注册协议》进行仔细阅读和确认。您若不同意更新后的协议，请您立即停止使用本软件。当发生有关争议时，以最新的协议为准。</strong>
      </p>
      <p class="MsoNormal"><span>&nbsp;</span></p>
      </p>
    </div>
    <div class="pop_footer">
      <a @click="close" class="f-r">确定</a>
    </div>
  </el-dialog>
</template>

<script>

  export default {
    props: ["dialogVisible"],
    data() {
      return {
        //修改密码dailog
        Visible: true,
      }
    },
    mounted() {
    },
    methods: {
      close(){
        this.$emit('close')
      }
    }
  }

</script>
